cHemingway/apollo3_spi_nand/src/nand_flash.c
/*
 * nand_flash.h
 * Driver for QuadSPI NAND Flash for Apollo 3 MCU
 * Copyright: Chris Hemingway, 2019
 */

//*****************************************************************************
//
// Functions nand_init, am_device_command_write, am_device_command_read 
// Copyright (c) 2019, Ambiq Micro
// All rights reserved.
// 
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions are met:
// 
// 1. Redistributions of source code must retain the above copyright notice,
// this list of conditions and the following disclaimer.
// 
// 2. Redistributions in binary form must reproduce the above copyright
// notice, this list of conditions and the following disclaimer in the
// documentation and/or other materials provided with the distribution.
// 
// 3. Neither the name of the copyright holder nor the names of its
// contributors may be used to endorse or promote products derived from this
// software without specific prior written permission.
// 
// Third party software included in this distribution is subject to the
// additional license terms as defined in the /docs/licenses directory.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
// AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
// IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
// ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
// LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
// CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
// SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
// INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
// CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
// ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
// POSSIBILITY OF SUCH DAMAGE.
//
//*****************************************************************************

#include <string.h> // memcmp

#include "nand_flash.h"
#include "nand_flash_private.h"
#include "onfi_print.h"

#include "am_util_stdio.h"
#include "am_util_delay.h"
#include "am_bsp.h"
#include "am_bsp_pins.h"

// Include direct regs for raw command queue pokery
#include "core_cm4.h"
#include "apollo3.h"

#ifdef MICRON_MT29F8G01AD
#include "mt79f_cmd_regs.h"           // Command and register values, page size
#endif

#if DEVICE_PAGE_SIZE != PAGE_SIZE
#error "PAGE_SIZE in nand_flash.h is not equal to device page size"
#endif

// Disable warning for unused functions in this file
#pragma GCC diagnostic ignored "-Wunused-function"


// Hack, use GPIO for CE
#define USE_GPIO_CE 1

// Timeout for MSPI HAL read/write acesses in microseconds
// Set to 10mS as flash should respond immediately
#define AM_DEVICES_MSPI_FLASH_TIMEOUT             10000

 // Time to wait in uS between polling the flash device status reg
 // Should be ~10x larger than execution time to ensure 90% accurate timing.
 // HAL has ~1uS delay minimum (due to polling loop), so 10uS sounds good
const uint32_t POLL_DELAY_US =                    10;


// Size chosen to fit in _nand_cmd_read_quadio comfortably
#define DMA_TCB_SIZE      64
uint32_t  g_TCB[DMA_TCB_SIZE];    // Transfer Control Buffer, used for Command Queue ops

#ifdef MICRON_MT29F8G01AD


// NAND Flash device configuration structure
am_hal_mspi_dev_config_t  g_psMSPISettings = 
{
    .eSpiMode             = AM_HAL_MSPI_SPI_MODE_0, // See micron datasheet
    .eClockFreq           = AM_HAL_MSPI_CLK_6MHZ,

    .ui8TurnAround        = 8,                       // For READ FROM CACHEx1 , 1 dummy byte = 8 bits
    .eAddrCfg             = AM_HAL_MSPI_ADDR_2_BYTE, // Read address is 13 bit (12 addr + pane) and 3 dummy bits = 16

    .eInstrCfg            = AM_HAL_MSPI_INSTR_1_BYTE,       // One byte SPI
    .eDeviceConfig        = AM_HAL_MSPI_FLASH_SERIAL_CE0,   // Single SPI, CS0
    .bSeparateIO          = true,                           // Seperate MOSI/MISO pins
    .bSendInstr           = true,                           // Send instruction
    .bSendAddr            = true,                           // Enable sending address
    .bTurnaround          = true,                           // Enable turnaround
    // TODO: These are for use with DMA, check if OK
    .ui8ReadInstr         = CMD_READ_CACHE_SINGLE,      
    .ui8WriteInstr        = CMD_PROGRAM_LOAD_RANDOM,
    .ui32TCBSize          = DMA_TCB_SIZE,                   // Command queue buffer
    .pTCB                 = g_TCB,
    .scramblingStartAddr  = 0,                              // No data scrambling
    .scramblingEndAddr    = 0,
};

#else // Not defined flash ID
#error "No Flash defined!"
#endif


typedef enum {
    ECC_OK = 0,
    ECC_CORRECTED,      // Low level of error, refreshment not needed
    ECC_SHOULD_REFRESH, // Medium error, should refresh
    ECC_MUST_REFRESH,   // High level of error, must refresh data
    ECC_FATAL           // Fatal error, cannot recover data fully
} ecc_err_t;


// Pointer to MSPI peripheral
void                            *g_pMSPIHandle;   

// Transaction state
am_hal_mspi_pio_transfer_t      g_PIOTransaction;


const uint32_t ui32Module = 0; // Index of MSPI module. Apollo3 only has MSPI0

// Forward definition
uint32_t nand_init_device(void);

// Convert a block number into a block/page address
static inline uint32_t block_to_page_addr(uint32_t block_addr) {
    return block_addr << LOG2_PPB;
}




// ISR Handler for MSPI peripheral. Calls back into HAL, same as others
// Don't use g_MSPIInterruptStatus, register callbacks with HAL
volatile uint32_t g_MSPIInterruptStatus;
void MSPI_IRQHandler(void)
{
    uint32_t      ui32Status;
    am_hal_mspi_interrupt_status_get(g_pMSPIHandle, &ui32Status, false);
    am_hal_mspi_interrupt_clear(g_pMSPIHandle, ui32Status);
    am_hal_mspi_interrupt_service(g_pMSPIHandle, ui32Status);
    g_MSPIInterruptStatus &= ~ui32Status;
}


// DMA Complete
volatile bool g_dma_complete;
void dma_complete_callback(void *pCallbackCtxt, uint32_t status)
{
    // Set the DMA complete flag.
    g_dma_complete = true;
}


//*****************************************************************************
//
// Generic Command Write function.
//
//*****************************************************************************
uint32_t am_device_command_write(uint32_t ui32Module, uint8_t ui8Instr, bool bSendAddr,
                                 uint32_t ui32Addr, uint32_t *pData,
                                 uint32_t ui32NumBytes)
{
    uint32_t ui32Status;

    // Create the individual write transaction.
    g_PIOTransaction.ui32NumBytes       = ui32NumBytes;
    g_PIOTransaction.eDirection         = AM_HAL_MSPI_TX;
    g_PIOTransaction.bSendAddr          = bSendAddr;
    g_PIOTransaction.ui32DeviceAddr     = ui32Addr;
    g_PIOTransaction.bSendInstr         = true;
    g_PIOTransaction.ui16DeviceInstr    = ui8Instr;
    g_PIOTransaction.bTurnaround        = false;
#if 0 // A3DS-25 Deprecate MSPI CONT
    g_PIOTransaction.bContinue          = false;
#endif // A3DS-25

    g_PIOTransaction.bQuadCmd         = false;
    g_PIOTransaction.pui32Buffer        = pData;

