cHemingway/apollo3_spi_nand/src/nand_flash.c
/*
 * Private function to change device to/from SPI to/from QuadSPI
 */
uint32_t mspi_set_use_quadspi(bool use_quadspi) {
    uint32_t ui32Status;

    // Disable MSPI defore re-configuring it
    ui32Status = am_hal_mspi_disable(g_pMSPIHandle);
    if (AM_HAL_STATUS_SUCCESS != ui32Status)
    {
        return AM_DEVICES_MSPI_FLASH_STATUS_ERROR;
    }
    //
    // Re-Configure the MSPI for the requested operation mode.
    //
    if (use_quadspi) {
        g_psMSPISettings.eDeviceConfig = AM_HAL_MSPI_FLASH_QUAD_CE0;
        g_psMSPISettings.eXipMixedMode = AM_HAL_MSPI_XIPMIXED_D4; // 1:1:4 for instruction, address, timing
    } else {
        g_psMSPISettings.eDeviceConfig = AM_HAL_MSPI_FLASH_SERIAL_CE0;
        g_psMSPISettings.eXipMixedMode = AM_HAL_MSPI_XIPMIXED_NORMAL; // 1:1:4 for instruction, address, timing
    }
    ui32Status = am_hal_mspi_device_configure(g_pMSPIHandle, &g_psMSPISettings);
    if (AM_HAL_STATUS_SUCCESS != ui32Status)
    {
        return AM_DEVICES_MSPI_FLASH_STATUS_ERROR;
    }
    // Re-Enable MSPI
    ui32Status = am_hal_mspi_enable(g_pMSPIHandle);
    if (AM_HAL_STATUS_SUCCESS != ui32Status)
    {
        return AM_DEVICES_MSPI_FLASH_STATUS_ERROR;
    }

    return AM_HAL_STATUS_SUCCESS;
}


uint32_t nand_id(void)
{
    uint32_t      ui32Status;
    uint32_t      ui32DeviceID;

    // Send device ID command, no address, and read 3 bytes (one dummy)
    ui32Status = am_device_command_read(ui32Module, CMD_READ_ID, false, 0, &ui32DeviceID, 3);
    // Shift out dummy byte
    ui32DeviceID >>= 8;
    
    // Check byte is valid
    if ( ((ui32DeviceID & nand_ID_MASK) == (nand_ID & nand_ID_MASK)) &&
       (AM_HAL_STATUS_SUCCESS == ui32Status) )
    {
        return AM_DEVICES_MSPI_FLASH_STATUS_SUCCESS;
    }
    else
    {
        return AM_DEVICES_MSPI_FLASH_STATUS_ERROR;
    }
}

/* 
 * Execute the GET_FEATURES command given a register address addr, to get the byte data
 * Not part of public API, as higher level functions (e.g. get status) should be used
 */
uint32_t _nand_cmd_get_features(uint8_t addr, uint8_t *data) {

    uint32_t ui32Status;
    uint32_t returned_data = 0;

    // The GET_FEATURES command uses 1 byte addresses, unlike all others 
    // HACK: Change the address size directly, rather than through HAL, as 
    // using HAL requires us to reconfigure entire peripheral.
    uint32_t mspi_cfg_old_asize = MSPI->CFG_b.ASIZE;
    MSPI->CFG_b.ASIZE = 0x00;   // Address is 1 byte

    // Create the individual write transaction.
    g_PIOTransaction.eDirection         = AM_HAL_MSPI_RX;
    g_PIOTransaction.bSendAddr          = true;    // Send address
    g_PIOTransaction.ui32DeviceAddr     = addr;
    g_PIOTransaction.bSendInstr         = true;     // Send instruction, 1 byte
    g_PIOTransaction.ui16DeviceInstr    = CMD_GET_FEATURES;
    g_PIOTransaction.bTurnaround        = false;
    g_PIOTransaction.ui32NumBytes       = 1;        // 1 byte read
    g_PIOTransaction.bQuadCmd           = false;    // SPI only, no quad or octal
    g_PIOTransaction.pui32Buffer        = &returned_data;    // Read into buffer given

    // Execute the transction over MSPI.
    ui32Status = am_hal_mspi_blocking_transfer(g_pMSPIHandle, &g_PIOTransaction,
                                         AM_DEVICES_MSPI_FLASH_TIMEOUT);

    // Reset instruction size to original config
    MSPI->CFG_b.ASIZE = mspi_cfg_old_asize;

    // Convert recieved from uint32_t to uint8_t
    *data = (uint8_t)(returned_data & 0xff);

    return ui32Status;
}


/* 
 * Execute the SET_FEATURES command given a register address addr, to get the byte data
 * Not part of public API, as higher level functions (e.g. get status) should be used
 */
uint32_t _nand_cmd_set_features(uint8_t addr, uint8_t data) {

    uint32_t ui32Status;
    uint32_t data32 = data;

    // The GET_FEATURES command uses 1 byte addresses, unlike all others 
    // HACK: Change the address size directly, rather than through HAL, as 
    // using HAL requires us to reconfigure entire peripheral.
    uint32_t mspi_cfg_old_asize = MSPI->CFG_b.ASIZE;
    MSPI->CFG_b.ASIZE = 0x00;   // Address is 1 byte

    // Create the individual write transaction.
    g_PIOTransaction.eDirection         = AM_HAL_MSPI_TX;
    g_PIOTransaction.bSendAddr          = true;    // Send address
    g_PIOTransaction.ui32DeviceAddr     = addr;
    g_PIOTransaction.bSendInstr         = true;     // Send instruction, 1 byte
    g_PIOTransaction.ui16DeviceInstr    = CMD_SET_FEATURES;
    g_PIOTransaction.bTurnaround        = false;
    g_PIOTransaction.ui32NumBytes       = 1;        // 1 byte write
    g_PIOTransaction.bQuadCmd           = false;    // SPI only, no quad or octal
    g_PIOTransaction.pui32Buffer        = &data32;    // Write 32 bit data

    // Execute the transction over MSPI.
    ui32Status = am_hal_mspi_blocking_transfer(g_pMSPIHandle, &g_PIOTransaction,
                                         AM_DEVICES_MSPI_FLASH_TIMEOUT);

    // Reset instruction size to original config
    MSPI->CFG_b.ASIZE = mspi_cfg_old_asize;

    return ui32Status;
}


uint32_t _nand_cmd_write_enable(void) {
    uint32_t      ui32Status;

    // Send write_enable command, no address, no data
    ui32Status = am_device_command_write(ui32Module, CMD_WRITE_ENABLE, false, 0, NULL, 0);
    return ui32Status;
}


uint32_t _nand_cmd_write_disable(void) {
    uint32_t      ui32Status;

    // Send write_enable command, no address, no data
    ui32Status = am_device_command_write(ui32Module, CMD_WRITE_DISABLE, false, 0, NULL, 0);
    return ui32Status;
}


uint32_t _nand_get_writable(bool *writable) {
    uint32_t    ui32Status;
    uint8_t    status_reg;

    // Get the status register
    ui32Status = _nand_cmd_get_features(FEATURE_REG_STATUS, &status_reg);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) { // Exit early on error
        return ui32Status;
    }

    if (status_reg & FEATURE_REG_STATUS_WEL_MASK) {
        *writable = true;
    } else {
        *writable = false;
    }

    return ui32Status;
}

