cHemingway/apollo3_spi_nand/src/nand_flash.c
/*
 * Check if NAND is currently busy, returns immediately
 */
uint32_t _nand_get_busy(bool *busy) {
    uint32_t    ui32Status;
    uint8_t    status_reg;

    // Get the status register
    ui32Status = _nand_cmd_get_features(FEATURE_REG_STATUS, &status_reg);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) { // Exit early on error
        return ui32Status;
    }

    if (status_reg & FEATURE_REG_STATUS_OIP_MASK) {
        *busy = true;
    } else {
        *busy = false;
    }

    return ui32Status;
}

/*
 * Wait until NAND is no longer busy, indicates if program or erase failure occured
 * status is pointer to raw status register, e.g. for checking ECC bits
 */
uint32_t nand_wait_busy(uint32_t timeout_us, bool *program_fail, bool *erase_fail,
                               uint8_t *status) {
    bool        busy;
    uint32_t    ui32Status;
    uint8_t    status_reg;
    int32_t    timeout_count = timeout_us; // Convert to integer so can go negative

    do {
        // Get the status register
        ui32Status = _nand_cmd_get_features(FEATURE_REG_STATUS, &status_reg);
        if (ui32Status != AM_HAL_STATUS_SUCCESS) { // Exit early on error
            return ui32Status;
        }
        // Get busy flag
        busy = (status_reg & FEATURE_REG_STATUS_OIP_MASK) != 0;
        if (!busy) {
            break;      // Exit loop early so we don't have delay if busy==false
        }
        am_util_delay_us(POLL_DELAY_US);
        timeout_count -= POLL_DELAY_US;
    } while (timeout_count>0);

    // Check if we timed out
    if (busy & (timeout_count <= 0)) {
        return AM_HAL_STATUS_TIMEOUT;
    }

    // Check bits
    *program_fail = (status_reg & FEATURE_REG_STATUS_P_FAIL_MASK) != 0;
    *erase_fail = (status_reg & FEATURE_REG_STATUS_E_FAIL_MASK) != 0;

    // Return raw status reg
    if (status != NULL) {
        *status = status_reg;
    }

    return ui32Status;
}


/* 
 * Execute PAGE_READ command to read a page into the cache given page address
 */
uint32_t _nand_cmd_page_read(uint32_t page_addr) {
    uint32_t ui32Status;

    // Change to 3 byte addresses 
    MSPI->CFG_b.ASIZE = 0x02;   // Address is 3 bytes
    ui32Status = am_device_command_write(ui32Module, CMD_PAGE_READ, true, page_addr, NULL, 0);
    return ui32Status;
}


/* 
 * Execute READ FROM CACHE x1 to read single page into Cache
 */
uint32_t _nand_cmd_read_x1(uint16_t column_addr, uint32_t *data, uint32_t data_len) {
    uint32_t ui32Status;
    uint32_t addr_plus_dummy = 0;

    // Hack: To make the MSPI peripheral ignore the dummy byte, we use 3 byte addresses 
    // and left shift the address by one byte
    MSPI->CFG_b.ASIZE = 0x02;   // Address is 3 bytes (but we keep byte 0 empty as dummy)

    addr_plus_dummy = (uint32_t)column_addr << 8; // Move along, leave blank space

    ui32Status = am_device_command_read(ui32Module, CMD_READ_CACHE_SINGLE, true, addr_plus_dummy, data , data_len);

    return ui32Status;
}

/* 
 * Execute READ FROM CACHE x4 to read single page into Cache with x1 instruction + address, x4 data
 * FIXME: Not currently working! Instr is sent as Quad, not SPI as it should be
 */
uint32_t _nand_cmd_read_x4(uint16_t column_addr, uint32_t *data, uint32_t data_len) {
    uint32_t ui32Status;

    // Change to 2 byte addresses
    MSPI->CFG_b.ASIZE = 0x01;   // Address is 2 bytes

    // 4 Turnaround cycles
    MSPI->CFG_b.TURNAROUND = 4;

    // Change to Quad mode
    ui32Status = mspi_set_use_quadspi(true);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;

    // Create the individual write transaction.
    g_PIOTransaction.eDirection         = AM_HAL_MSPI_RX;
    g_PIOTransaction.bSendAddr          = true;
    g_PIOTransaction.ui32DeviceAddr     = column_addr;
    g_PIOTransaction.bSendInstr         = true;
    g_PIOTransaction.ui16DeviceInstr    = CMD_READ_CACHE_X4;
    g_PIOTransaction.bTurnaround        = true;
    g_PIOTransaction.ui32NumBytes       = data_len;
    g_PIOTransaction.bQuadCmd           = true;    // Command is _not_ quad, only address + data

    g_PIOTransaction.pui32Buffer        = data;

    // Execute the transction over MSPI.
    ui32Status = am_hal_mspi_blocking_transfer(g_pMSPIHandle, &g_PIOTransaction,
                                         AM_DEVICES_MSPI_FLASH_TIMEOUT);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;

    // Change back to SPI mode
    ui32Status = mspi_set_use_quadspi(false);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;

    return ui32Status;
}


/* 
 * Execute READ FROM CACHE Quad I/O to read single page into Cache
 * FIXME: Does not seem to be respecting _turnaround_ setting?
 */
uint32_t _nand_cmd_read_quadio(uint16_t column_addr, uint8_t *data, uint32_t data_len) {
    uint32_t ui32Status;

    am_hal_mspi_cq_raw_t raw_cq;

    // Command queue, format register, value. Processed sequentially and automatically in hw
    am_hal_cmdq_entry_t command_queue[] = {
        // Transaction one, address + data
            // Set address, must be position 0 as overwritten
            [0]{.address = (uint32_t)&(MSPI->ADDR),
                .value = 0xDEAD
            },
            // Set instruction
            {.address = (uint32_t)&(MSPI->INSTR),
             .value = CMD_READ_CACHE_X4
            },
            // Config, single width
            {.address = (uint32_t)&(MSPI->CFG),
             .value =  
                      // SPI Mode 0. TODO: Take from config
                      _VAL2FLD(MSPI_CFG_CPOL, 0)    | 
                      _VAL2FLD(MSPI_CFG_CPHA, 0)    |
                      // Turnaround is 8 cycles. TODO: Take from config
                      _VAL2FLD(MSPI_CFG_TURNAROUND, 8)    |
                      // Set instruction and address size
                      _VAL2FLD(MSPI_CFG_ISIZE, AM_HAL_MSPI_INSTR_1_BYTE)  |
                      _VAL2FLD(MSPI_CFG_ASIZE, AM_HAL_MSPI_ADDR_2_BYTE)   |
                      // Set device config. TODO: Make configurable
                      // Here we make this SPI, pin 0, as _this_ part is 1 bit wide
                      _VAL2FLD(MSPI_CFG_DEVCFG, MSPI_CFG_DEVCFG_SERIAL0)
            },
            // Write to control register with start bit set to kick this off
            {.address = (uint32_t)&(MSPI->CTRL),
             .value = _VAL2FLD(MSPI_CTRL_XFERBYTES, 0) |
                      // TX transaction, so we get TX->RX CFG_TURNAROUND
                      _VAL2FLD(MSPI_CTRL_TXRX, AM_HAL_MSPI_TX) |
                      // Send instruction and address
                      _VAL2FLD(MSPI_CTRL_SENDI, 1) |
                      _VAL2FLD(MSPI_CTRL_SENDA, 1) |
                      // Enable turnaround cycles
                      _VAL2FLD(MSPI_CTRL_ENTURN, 1) |
                      // Default little endian
                      _VAL2FLD(MSPI_CTRL_BIGENDIAN, 0) |
                      _VAL2FLD(MSPI_CTRL_START, 1)
             },
        // Section 2, QUAD with no instruction or address, just data
        // We use the DMA peripheral here as well, but _not_ with DMAEN_AUTO
        // as DMAEN_AUTO would mean the DMA would attempt to send instruction/address
        // See Datasheet 7.4 DMA Operations.
        // FIXME: CS goes high in between!

            // Data address for DMA to transfer _to_.  Overwritten later
            [4]{.address = (uint32_t)&(MSPI->DMATARGADDR),
                .value = 0
            },
            // Number of _bytes_ to DMA. Overwritten later
            [5]{.address = (uint32_t)&(MSPI->DMATOTCOUNT),
                .value = 0
            },
            // Device register to DMA _from_. As we are recieving, use RX FIFO
            // FIXME: Should this be external address? We are not sending address?
            {.address = (uint32_t)&(MSPI->DMADEVADDR),
             .value = (uint32_t)&(MSPI->RXFIFO)
            },
            // DMA trigger threshold, FIFO half full
            {
             .address = (uint32_t)&(MSPI->DMATHRESH),
             .value = 8
            },
            // DMA burst size, 32 bytes = 8 words, empty FIFO
            {
             .address = (uint32_t)&(MSPI->DMABCOUNT),
             .value = 32
            },
            // Config reg
            {.address = (uint32_t)&(MSPI->CFG),
             .value =  
                      // Turnaround is 8 cycles. TODO: Take from config
                      _VAL2FLD(MSPI_CFG_TURNAROUND, 8)    |
                      // Set to QUAD mode
                      _VAL2FLD(MSPI_CFG_DEVCFG, MSPI_CFG_DEVCFG_QUAD0)
            },
            // Write to control register. Don't start, as DMA will
            // We will overwrite the XFERBYTES part here later
            [10]{.address = (uint32_t)&(MSPI->CTRL),
             .value = _VAL2FLD(MSPI_CTRL_XFERBYTES, 0) |
                      // RX Transaction
                      _VAL2FLD(MSPI_CTRL_TXRX, AM_HAL_MSPI_RX) |
                      // Send instruction and address
                      _VAL2FLD(MSPI_CTRL_SENDI, 0) |
                      _VAL2FLD(MSPI_CTRL_SENDA, 0) |
                      // Enable turnaround cycles
                      _VAL2FLD(MSPI_CTRL_ENTURN, 1) |
                      // Default little endian
                      _VAL2FLD(MSPI_CTRL_BIGENDIAN, 0) |
                      // Don't start, as DMA will
                      _VAL2FLD(MSPI_CTRL_START, 0)
             },
             // Setup DMA Flash register, disable instr/data, enable turnaround
             {.address = (uint32_t)&(MSPI->FLASH),
              .value = // Don't send instruction or address in DMA transaction
                       _VAL2FLD(MSPI_FLASH_XIPSENDI, 0) |
                       _VAL2FLD(MSPI_FLASH_XIPSENDA, 0) |
                       // Enable turnaround cycles in DMA operations
                       _VAL2FLD(MSPI_FLASH_XIPENTURN, 1)
             },
             // Configure DMA, starting DMA transfer from started peripheral
             {.address = (uint32_t)&(MSPI->DMACFG),
                       // Disable power off after complete, HAL claims is not supported?
              .value = _VAL2FLD(MSPI_DMACFG_DMAPWROFF, 0) |
                       // Set low priority, as peripheral should pause SCLK on overflow?
                       _VAL2FLD(MSPI_DMACFG_DMAPRI, 0)    |
                       // Direction is peripheral -> memory
                       _VAL2FLD(MSPI_DMACFG_DMADIR, MSPI_DMACFG_DMADIR_P2M) |
                       // We set auto dir
                       _VAL2FLD(MSPI_DMACFG_DMAEN, MSPI_DMACFG_DMAEN_EN)
             }

