cHemingway/apollo3_spi_nand/src/nand_flash.c
    };

    // Override column address, first position in queue
    command_queue[0].value = (uint32_t)column_addr;
    
    // Override data address and length
    command_queue[4].value = (uint32_t)data;
    command_queue[5].value = (uint32_t)data_len;    // Size of DMA, in bytes
    command_queue[10].value |= _VAL2FLD(MSPI_CTRL_XFERBYTES, data_len);

    // Setup queue wrapper struct
    raw_cq.ui32PauseCondition = 0;  // Pre transaction, no pause.
    raw_cq.pCQEntry = command_queue;        // Queue
    raw_cq.numEntries = sizeof(command_queue) / sizeof(command_queue[0]);
    raw_cq.pfnCallback = dma_complete_callback; // Hit this callback when done
    raw_cq.pCallbackCtxt = NULL;                // No data for callback
    // I think JmpAddr is for loop back? Leaving NULL for now
    raw_cq.pJmpAddr = NULL;

    #if USE_GPIO_CE
    // Hack: Reconfig CS as GPIO and config
    // Make constant of form AM_HAL_PIN_xx_GPIO
    #define ADD_GPIO(x)   AM_HAL_PIN_ ## x ## _GPIO
    #define CE_FUNC_GPIO(x) ADD_GPIO(x)

    am_hal_gpio_pincfg_t cs_cfg = g_AM_BSP_GPIO_MSPI_CE0;
    cs_cfg.uFuncSel = CE_FUNC_GPIO(AM_BSP_GPIO_MSPI_CE0);
    cs_cfg.eGPOutcfg = AM_HAL_GPIO_PIN_OUTCFG_PUSHPULL;

    #undef ADD_GPIO
    #undef CE_FUNC_GPIO

    #endif

    am_hal_gpio_pinconfig(AM_BSP_GPIO_MSPI_CE0, cs_cfg);
    am_hal_gpio_output_clear(AM_BSP_GPIO_MSPI_CE0);

    ui32Status = am_hal_mspi_control(g_pMSPIHandle, AM_HAL_MSPI_REQ_CQ_RAW, &raw_cq);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;

    // FIXME: Hits an interrupt here?
    for (uint32_t i=0; i<AM_DEVICES_MSPI_FLASH_TIMEOUT; i++) {
        if (g_dma_complete) {
            break;
        }
        am_util_delay_us(1);
    }

    #if USE_GPIO_CE
    // Hack: Manually raise CS, as 
    am_hal_gpio_output_set(AM_BSP_GPIO_MSPI_CE0);
    am_util_delay_us(100);
    am_hal_gpio_pinconfig(AM_BSP_GPIO_MSPI_CE0, g_AM_BSP_GPIO_MSPI_CE0);
    #endif

    // Todo, check if error occured in queue?

    return ui32Status;
}

/* 
 * Execute Program Load x1 to write single page into cache
 */
uint32_t _nand_cmd_program_load_x1(uint16_t column_addr, uint32_t *data, uint32_t data_len) {
    uint32_t ui32Status;

    // Change to 2 byte addresses
    MSPI->CFG_b.ASIZE = 0x01;   // Address is 2 bytes

    // No turnaround, immediately send data
    MSPI->CFG_b.TURNAROUND = 0;

    ui32Status = am_device_command_write(ui32Module, CMD_PROGRAM_LOAD, true, column_addr, data , data_len);

    return ui32Status;
}


/* 
 * Execute Random Data Program x1, writes to cache _without_ clearing it
 */
uint32_t _nand_cmd_program_load_random_x1(uint16_t column_addr, uint32_t *data, uint32_t data_len) {
    uint32_t ui32Status;

    // Change to 2 byte addresses
    MSPI->CFG_b.ASIZE = 0x01;   // Address is 2 bytes

    // No turnaround, immediately send data
    MSPI->CFG_b.TURNAROUND = 0;

    ui32Status = am_device_command_write(ui32Module, CMD_PROGRAM_LOAD_RANDOM, true, column_addr, data , data_len);

    return ui32Status;
}


/* 
 * Execute PROGRAM_EXECUTE to write a page from the cache given page address
 */
uint32_t _nand_cmd_program_execute(uint32_t page_addr) {
    uint32_t ui32Status;

    // Change to 3 byte addresses 
    MSPI->CFG_b.ASIZE = 0x02;   // Address is 3 bytes
    ui32Status = am_device_command_write(ui32Module, CMD_PROGRAM_EXECUTE, true, page_addr, NULL, 0);
    return ui32Status;
}


/*
 * Execute BLOCK_ERASE to erase an entire block
 */
uint32_t _nand_cmd_block_erase(uint32_t page_addr) {
    uint32_t ui32Status;

    // Change to 3 byte addresses 
    MSPI->CFG_b.ASIZE = 0x02;   // Address is 3 bytes
    ui32Status = am_device_command_write(ui32Module, CMD_BLOCK_ERASE, true, page_addr, NULL, 0);
    return ui32Status;
}


// Get ECC bits from status register
static ecc_err_t nand_status_to_ecc(uint8_t status_reg) {
    // Decode status reg into ECC error count, device specific
    #ifdef MICRON_MT29F8G01AD
    switch ((status_reg & FEATURE_REG_STATUS_ECC_MASK) >> FEATURE_REG_STATUS_ECC_SHIFT)
    {
        case FEATURE_REG_STATUS_ECC_NO_ERR:
            return ECC_OK;
        case FEATURE_REG_STATUS_ECC_1_3_ERR:
            return ECC_CORRECTED;
        case FEATURE_REG_STATUS_ECC_4_6_ERR:
            return ECC_SHOULD_REFRESH;
        case FEATURE_REG_STATUS_ECC_7_8_ERR:
            return ECC_MUST_REFRESH;
        case FEATURE_REG_STATUS_ECC_FATAL_ERR:
            return ECC_FATAL;
        default: // Should never happen! Safest to assume data is corrupted
            return ECC_FATAL;
    }
    #endif
}

/*
 * Device specific initialization commands
 */
uint32_t nand_init_device(void) {
    // Unlock all blocks, as all are locked by default after power up
    return _nand_cmd_set_features(FEATURE_REG_BLOCK_LOCK, FEATURE_REG_BLOCK_LOCK_UNLOCK_ALL);
}


/*
 * Erase a block and checks status returned by chip
 */
uint32_t nand_erase_block(uint16_t block_addr) {
    uint32_t ui32Status;
    bool unused, erase_err;
    // Enable write, as gets cleared by last program or erase_block function
    ui32Status = _nand_cmd_write_enable();
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;
    // Block erase command
    ui32Status = _nand_cmd_block_erase(block_to_page_addr(block_addr));
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;
    // Wait until not busy, check erase err, but ignore program error
    ui32Status = nand_wait_busy(ERASE_TIME_US, &unused, &erase_err, NULL);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;
    if (erase_err) return AM_HAL_STATUS_HW_ERR;
    return AM_HAL_STATUS_SUCCESS;
}


/*
 * Function to program a page. Takes data[] of PAGE_SIZE and programs the lot
 * Caution: Does not check if block is bad or not!
 */
uint32_t nand_prog_page(uint32_t page_addr, const uint8_t data[]) {
    bool program_fail, erase_fail;
    uint32_t ui32Status;

    // Write enable must be sent before program load and program execute
    ui32Status = _nand_cmd_write_enable();
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;
    // Load marker value into our byte offset, within spare area
    ui32Status = _nand_cmd_program_load_x1(0, (uint32_t *)data, PAGE_SIZE);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;
    // Execute the write, write enable must be sent just before!
    ui32Status = _nand_cmd_write_enable();
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;
    ui32Status = _nand_cmd_program_execute(page_addr);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;
    // Wait for write to be completed, or error
    ui32Status = nand_wait_busy(PROGRAM_TIME_US, &program_fail, &erase_fail, NULL);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;
    if (program_fail) return AM_HAL_STATUS_HW_ERR;

