cHemingway/apollo3_spi_nand/src/nand_flash.c
    return AM_HAL_STATUS_SUCCESS; // Success
}


/*
 * Check that the given page has been erased. 
 * Sets is_free to true if so, false if not
 */
uint32_t nand_is_free(uint32_t page_addr, bool *is_free) {
    uint32_t ui32Status;

    uint8_t ecc_data[ECC_AREA_LENGTH]; 
    
    /* We check if a page is free by reading the ECC data from the main/spare area
     * If it is all 0xFF, then it is extremely likely that the page has not been programmed
     * The chance of it all being 0xFF by coincidence is 1 / 2^(ECC_AREA_LENGTH)
     * TODO: Check this does not occur for all zero data
     */

    // Don't check ECC in status reg on read, as the ECC bits are not themselves ECC protected
    ui32Status = nand_read_page(page_addr, ECC_AREA_OFFSET, ecc_data, 
                                ECC_AREA_LENGTH, NULL);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;

    if (is_free != NULL) {
        *is_free = true;
        // Check if free by testing every byte against unprogrammed value
        // We could speed this up by checking 32 bits at a time
        for(int i=0; i<ECC_AREA_LENGTH; i++) {
            if (ecc_data[i] != ECC_UNPROGRAMMED_VALUE) {
                *is_free = false;
            }
        }
    } 
    // Success
    return AM_HAL_STATUS_SUCCESS;
}


/*
 * Read a portion of a page
 * Sets ecc_fatal if an uncorrectable ECC error occurred (correctable is ignored)
 */
uint32_t nand_read_page(uint32_t page_addr, uint16_t offset, 
                             uint8_t *data, uint32_t len, 
                             bool *ecc_fatal) {
    uint32_t ui32Status;
    bool ignore1, ignore2;
    uint8_t status_reg;
    ecc_err_t ecc_err;

    // Issue page read command
    ui32Status = _nand_cmd_page_read(page_addr);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;
    // Wait for completion
    ui32Status = nand_wait_busy(PAGE_READ_TIME_US, &ignore1, &ignore2, &status_reg);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;
    // Check ECC error. TODO: ECC error counters
    ecc_err = nand_status_to_ecc(status_reg);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;
    if (ecc_fatal != NULL) {
    *ecc_fatal = (ecc_err == ECC_FATAL);
    }
    // Read out the data at offset
    ui32Status = _nand_cmd_read_x1(offset, (uint32_t *)data, len);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;
    // Success
    return AM_HAL_STATUS_SUCCESS;
}


/*
 * Copy a page from one address to another.
 * Takes source and destination address, and detects if an ECC error occured.
 * Uses flash devices internal cache for speed.
 */
uint32_t nand_copy_page(uint32_t src_page_addr, uint32_t dest_page_addr, bool *ecc_fatal) {
    uint32_t ui32Status;
    bool unused1, unused2;
    uint8_t status_reg;
    ecc_err_t ecc_err;

    /*
     * Following INTERNAL_DATA_MOVE sequence of Micron MT79A
     */
    ui32Status = _nand_cmd_page_read(src_page_addr);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;
    // Not mentioned in datasheet if checking status reg is needed here
    // However otherwise, we would not get ECC status
    // TODO: Check status reg at end for ECC errors
    ui32Status = nand_wait_busy(PAGE_READ_TIME_US, &unused1, &unused2, &status_reg);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;
    ecc_err = nand_status_to_ecc(status_reg);
    if ((ecc_err == ECC_FATAL) && (ecc_fatal != NULL)) {
        *ecc_fatal = true;
        return AM_HAL_STATUS_HW_ERR; // Exit early on ECC fail
    }
    // Enable write, must be called before program ops
    ui32Status = _nand_cmd_write_enable();
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;
    // PROGRAM_LOAD_RANDOM_DATA with no data, bit unclear if nescessary
    ui32Status = _nand_cmd_program_load_random_x1(0, NULL, 0);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;
    // Finally, write out the page
    ui32Status = _nand_cmd_program_execute(dest_page_addr);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;
    ui32Status = nand_wait_busy(PROGRAM_TIME_US, &unused1, &unused2, &status_reg);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;
    // Success!
    return AM_HAL_STATUS_SUCCESS;
}


/*
 * Read the parameter page (blocking) from the flash into *params_page of size len
 * Len must be > PARAMETER_PAGE_SIZE
 */
uint32_t nand_read_params_page(uint8_t *params_page, uint32_t len, bool use_quad) {
    uint32_t ui32Status;
    uint8_t  reg_config, old_reg_config;

    // Check length parameter
    if (len < PARAMETER_PAGE_SIZE) {
        return AM_HAL_STATUS_INVALID_ARG;
    }

    // Modify CFG bits of Feature register Configuration (0xB0) to get params page
    ui32Status = _nand_cmd_get_features(FEATURE_REG_CONFIG, &old_reg_config);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;

    reg_config = old_reg_config & ~FEATURE_REG_CONFIG_CFG_MASK; // Clear CFG bits
    reg_config |= FEATURE_REG_CONFIG_CFG_VALUE_READ_PARAMS;     // Set CFG to VALUE_READ_PARAMS, 010

    ui32Status = _nand_cmd_set_features(FEATURE_REG_CONFIG, reg_config);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;

    // Read parameter page. ECC is not used for this page, see datasheet.
    ui32Status = nand_read_page(PARAMETER_PAGE_PAGE_ADDR, PARAMETER_PAGE_COLUMN_ADDR,
                   params_page, len, NULL); 
        if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;

    // Write original value back to old_reg_config to exit parameter page reading mode
    ui32Status = _nand_cmd_set_features(FEATURE_REG_CONFIG, old_reg_config);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;

    return AM_HAL_STATUS_SUCCESS; // Return success
}


uint32_t nand_check_bad_block(uint32_t block_addr, bool *is_bad) {
    uint32_t ui32Status, page_addr;
    uint8_t markers[BAD_BLOCK_AREA_LENGTH];

    // Convert block addr into page addr (get first page)
    page_addr = block_to_page_addr(block_addr);

    // Read two bytes at marker address of first byte. One factory, one ours
    // We ignore ECC as won't be set for a bad block
    ui32Status = nand_read_page(page_addr + BAD_BLOCK_PAGE_OFFSET, 
                                BAD_BLOCK_AREA_OFFSET,
                                markers, BAD_BLOCK_AREA_LENGTH, NULL); 
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;

