cHemingway/apollo3_spi_nand/src/nand_flash.c
    // Check for bad block markers
    *is_bad = ((markers[BAD_BLOCK_OUR_BYTE_OFFSET]     == BAD_BLOCK_MARKER_VALUE) || 
               (markers[BAD_BLOCK_FACTORY_BYTE_OFFSET] == BAD_BLOCK_MARKER_VALUE));
    // Success
    return ui32Status;
}


/*
 * Function to mark a block as bad, takes block (not page) address
 * Requires write to previously be enabled, and the spare location to equal 0xff
 * Caution: Not intended to be reversible!
 */
uint32_t nand_mark_bad_block(uint32_t block_addr) {
    bool busy = false, program_fail, erase_fail;
    uint32_t ui32Status, page_addr;
    uint8_t marker_value[] = {BAD_BLOCK_MARKER_VALUE}; // Needs to be array

    /*
     * We mark a block as bad by writing into our own
     * To do this without loosing all the page data (useful for recovery?) we
     * - Load the page into the cache register
     * - Overwrite only our byte of the cache using program_load_random
     * - Execute the write using program execute
     * - Check completed, and OK (no write error)
     */
    page_addr = block_to_page_addr(block_addr);
    // Read page into cache
    ui32Status = _nand_cmd_page_read(page_addr);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;
    // Wait until read completed
    do {
        ui32Status = _nand_get_busy(&busy);
        if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;
    } while(busy);

    // Execute the write, write enable must be sent before program load
    ui32Status = _nand_cmd_write_enable();
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;
    // Load marker value into our byte offset, within spare area
    ui32Status = _nand_cmd_program_load_random_x1(BAD_BLOCK_AREA_OFFSET + BAD_BLOCK_OUR_BYTE_OFFSET,
                                                      (uint32_t *)marker_value,
                                                      1);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;
    ui32Status = _nand_cmd_program_execute(page_addr);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;
    // Wait for write to be completed, or error
    ui32Status = nand_wait_busy(PROGRAM_TIME_US, &program_fail, &erase_fail, NULL);
    if (ui32Status != AM_HAL_STATUS_SUCCESS) return ui32Status;
    if (program_fail) return AM_HAL_STATUS_HW_ERR;

    return AM_HAL_STATUS_SUCCESS; // Success
}


/*
 * Utility function to print the address of all bad blocks
 * Can take a few hundred ms or so
 * FIXME: Why are we not finding any bad blocks?
 */
uint32_t nand_print_bad_blocks(void) {
    bool is_bad;
    uint32_t ui32Status, total = 0;

    am_util_stdio_printf("Checking for Bad Blocks, addresses (decimal): \n");
    for (uint32_t i=0; i<NUM_BLOCKS; i++) {
        ui32Status = nand_check_bad_block(i, &is_bad);
        if (ui32Status != AM_HAL_STATUS_SUCCESS) {
            am_util_stdio_printf("Failed to read block %lu \n", i);
            return ui32Status;
        }
        if (is_bad) {
            am_util_stdio_printf("%lu \n", i);
            total++;
        }
    }
    am_util_stdio_printf("COMPLETE, found %lu \n", total);
    return ui32Status;
}